/*
#include<stdio.h>
int main()
{
  int row,col;
  scanf("%d %d",&row,&col);  // রো এবং কলাম ইনপুট নেওয়া হচ্ছে। 
  int a[row][col];      // ইনপুট নেওয়া রো এবং কলাম দিয়ে 2D এরে ডিক্লেয়ার করা হচ্ছে।
  for(int i=0;i<row;i++)
  {
    for(int j=0;j<col;j++)
    {
      scanf("%d",&a[i][j]);  // 2D এরে ইনপুট নেওয়া হচ্ছে নেস্টেড লুপ দিয়ে। 
    }
  }
  for(int i=0;i<row;i++)     // নেস্টেড লুপের আউটার লুপ
  {
    for(int j=col-1;j>=0;j--)  // নেস্টেড লুপের ইনার লুপ। রো উল্টো করে প্রিন্ট করার জন্য এই লুপটি উল্টো চালানো হয়েছে। 
    {
      printf("%d ",a[i][j]);  // প্রিন্ট করা হচ্ছে। 
    }
    printf("\n");
  }
  return 0;
}
*/