/*
#include<stdio.h>
int main()
{
  int x = 10;   
  printf("Value = %d\n",x);   // x এর মান প্রিন্ট করছি।
  printf("Address = %p\n",&x); // x ভেরিয়েবলটি মেমরিতে কোন এড্রেসে সেইভ আছে তা প্রিন্ট করছি।
}
*/

/*
#include<stdio.h>
int main()
{
  int x = 10;
  printf("Address = %p\n",&x); // x এর এড্রেস সরাসরি প্রিন্ট করা হচ্ছে। 
  int* p = &x;         // x এর এড্রেস একটি পয়েন্টার ভেরিয়েবলে রাখা হচ্ছে। এখানে পয়েন্টার ভেরিয়েবলটি x কে পয়েন্ট করবে তাই এর ডাটা টাইপ হিসেবে int* দেওয়া হয়েছে। পয়েন্টার এর নাম p দেওয়া হয়েছে।
  printf("Address = %p\n",p);  // পয়েন্টার ভেরিয়েবলটি প্রিন্ট করা হচ্ছে।
}
*/

/*
#include<stdio.h>
int main()
{
  int x = 10;
  int* p = &x;         // x এর এড্রেস একটি পয়েন্টার ভেরিয়েবলে রাখা হচ্ছে।
  printf("Value = %d\n",*p);  // পয়েন্টার দিয়ে x এর ভেলু প্রিন্ট করা হচ্ছে।

  *p = 20;           // পয়েন্টার দিয়ে x এর মান চেঞ্জ করে দেওয়া হচ্ছে।
  printf("Value = %d\n",x);  // পয়েন্টার দিয়ে চেঞ্জ করার পর x কে প্রিন্ট করে দেখা যাচ্ছে x এর মান চেঞ্জ হয়ে গিয়েছে। 
}
*/