/*
#include<stdio.h>
long long int fact(long long int n)
{
    // base case
    if(n==0)          // বেস কেস হিসেবে ০ দেওয়া হয়েছে। আমরা n থেকে ১ পর্যন্ত গুন করতে হবে। তাই ০ তে আসলে আমরা গুন করা থামিয়ে দিব।   
    {
        return 1;     // ১ রিটার্ন করা হচ্ছে, কারন বেস কেসে আসা মানে হচ্ছে আমাদের ফেক্টরিয়াল বের করা শেষ। তাই তার সাথে ১ গুন করে রিটার্ন করে দিচ্ছি। গুনফল এর সাথে ১ গুন করায় গুনফলের কোন পরিবর্তন হচ্ছে না। এখানে আমরা ০ রিটার্ন করি নি কারন গুনফলের সাথে ০ গুন করলে সম্পূর্ণ গুনফল ০ হয়ে যাবে।
        
    }
    long long int ans=fact(n-1);   // রিকারশন ফাংশনকে বলছি n-1 এর ফেক্টরিয়াল বের করে আনতে। আমরা ধরে নিব সে n-1 এর ফেক্টরিয়াল বের করে নিয়ে আসবে।
    return ans*n;           // তারপর সেই n-1 এর ফেক্টরিয়াল এর সাথে আমরা n কে গুন করে রিটার্ন করে দিচ্ছি যা আমাদের আন্সার।
}
int main()
{
    long long int n;        
    scanf("%lld",&n);        // সংখ্যাটি ইনপুট নিচ্ছি। 
    long long int ans=fact(n);    //  রিকারশন ফাংশনকে কল করছি এবং ফাংশনের রিটার্ন করা আন্সার স্টোর করছি।
    printf("%lld",ans);         // আন্সার প্রিন্ট করছি। 
    return 0;
}
*/