/*
#include<stdio.h>

int main()

{

 int n;

 scanf("%d",&n);

 int a[n];

 for(int i=0;i<n;i++)

 {

 scanf("%d",&a[i]); // এরে ইনপুট নেওয়া হচ্ছে।

 }

 int zero=0,one=0,two=0; 
 // জিরো, ওয়ান, টু কাউন্ট করার জন্য তিনটি ভেরিয়েবল নেওয়া হয়েছে।

 for(int i=0;i<n;i++) // লুপ চালিয়ে সম্পূর্ণ এরে ট্রাভারস করা হচ্ছে।

 {

 if(a[i]==0) // চেক করা হচ্ছে এরের এলিমেন্টটি জিরো কিনা।

 zero++; // যদি জিরো হয় তাহলে জিরো ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে।

 if(a[i]==1) // চেক করা হচ্ছে এরের এলিমেন্টটি ওয়ান কিনা।

 one++; // যদি ওয়ান হয় তাহলে ওয়ান ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে। 

 if(a[i]==2) // চেক করা হচ্ছে এরের এলিমেন্টটি টু কিনা।

 two++; // যদি টু হয় তাহলে টু ভেরিয়েবল এর মান ১ বাড়িয়ে দেওয়া হচ্ছে। 

 }

 printf("O -> %d\n",zero); // প্রিন্ট করা হচ্ছে 0,1,2 কতবার করে আছে।

 printf("1 -> %d\n",one);

 printf("2 -> %d\n",two)Comment
;

 return 0;

}
*/

/*
#include<stdio.h>

int main()

{

 int n;

 scanf("%d",&n);

 int a[n];

 for(int i=0;i<n;i++)

 {

 scanf("%d",&a[i]); // এরে ইনপুট নেওয়া হচ্ছে। 

 }

 int cnt[7]={0}; // একটি কাউন্টিং এরে ডিক্লেয়ার করা হচ্ছে ৭ সাইজের। তাহলে এর ইন্ডেক্স হবে ০ থেকে ৬। এই এরে দিয়ে ০ থেকে ৬ পর্যন্ত সবগুলো সংখ্যা কোনটি কতবার আছে তা কাউন্ট করে রাখা যাবে। যেহেতু এখানে আমরা কাউন্ট করছি তাই শুরুতে প্রতিটি ভেলু ০ ইনিশিয়াল করে দেওয়া হয়েছে।

 for(int i=0;i<n;i++) // লুপ চালিয়ে এরের প্রতিটি ইনডেক্স এক্সেস করা হচ্ছে।

 {

 int val=a[i]; 
 // এরের এলিমেন্টটি বের করা রাখা হচ্ছে আরেকটি ভেরিয়েবলে, পরবর্তীতে কাউন্ট করার জন্য।

 cnt[val]++; 
 // ভেলুর মান যত কাউন্টিং এরের ওই ইন্ডেক্সে যেয়ে সেটার কাউন্ট এর মান ১ বাড়িয়ে দেওয়া হচ্ছে। এরের এলিমেন্টটি যদি ১ হয় তাহলে কাউন্টিং এরের ১ নম্বর     ইন্ডেক্সে /যেয়ে তার ভেলু ১ বাড়িয়ে দেওয়া হচ্ছে। এরের এলিমেন্টটি যদি ১০ হয় তাহলে কাউন্টিং এরের ১০ নম্বর ইন্ডেক্সে যেয়ে তার ভেলু ১ বাড়িয়ে দেওয়া হচ্ছে। 

 }

 

 for(int i=0;i<=6;i++) // এবার কাউন্টিং এরের উপর লুপ চালানো হচ্ছে

 {

 printf("%d - %d\n",i,cnt[i]); 
 // প্রথমে ইন্ডেক্স প্রিন্ট করা হচ্ছে অর্থাৎ সংখ্যা এবং তারপর সেই ইন্ডেএক্সের মান অর্থাৎ সেই সংখ্যাটি কতবার আছে তা প্রিন্ট করা হচ্ছে।

 }

 return 0;

}
*/