/*
#include<stdio.h>
#include<string.h>
int main()
{
  char s[1001],t[1001];  // কোশ্চেনে বলা আছে একেকটি স্ট্রিং ১০০০ লেন্থ পর্যন্ত হতে পারে। তাই আমরা ১ বেশি সাইজ নিচ্ছি যাতে নাল বসানোর জায়গা থাকে।
  scanf("%s %s",&s,&t);  // দুটি স্ট্রিং ইনপুট নিচ্ছি।
  int lenS=strlen(s);   // প্রথম স্ট্রিং এর লেন্থ বের করছি।
  int lenT = strlen(t);  // দ্বিতীয় স্ট্রিং এর লেন্থ বের করছি।
  printf("%d %d\n",lenS,lenT); // দুটি লেন্থ পাশাপাশি প্রিন্ট করছি।
  printf("%s %s\n",s,t);  // দুটি স্ট্রিং পাশাপাশি প্রিন্ট করছি।
  return 0;
}
*/