/*
#include<stdio.h>
int main()
{
    int a[5][3];     // 2D এরে ডিক্লেয়ার করা হচ্ছে
    for(int i=0;i<5;i++)   // 2D এরের সাইজ ৫ পর্যন্ত লুপ চালানো হচ্ছে। এই লুপ 2D এরের প্রতিটি ইন্ডেক্সে যাবে। 
    {
        for(int j=0;j<3;j++) // 2D এরের প্রতিটি ইন্ডেক্সে একটি এরে আছে যা ৩ সাইজের, তাই ৩ পর্যন্ত লুপ চালানো হচ্ছে। 
        {
            printf("a[%d][%d] ",i,j);   // i,j প্রিন্ট করা হচ্ছে, যা 2D এরের রো এবং কলাম প্রিন্ট করবে অর্থাৎ ইন্ডেক্স প্রিন্ট করবে। 
        }
        printf("\n");  // ভিতরের এরের সবগুলো ইন্ডেক্স প্রিন্ট করার পর নতুন লাইন প্রিন্ট করা হচ্ছে।
    }
    return 0;
}
*/

/*
#include<stdio.h>
int main()
{
    int a[5][3];     // 2D এরে ডিক্লেয়ার করা হচ্ছে
    for(int i=0;i<5;i++)
    {
        for(int j=0;j<3;j++)
        {
            scanf("%d",&a[i][j]);   // ইনপুট নেওয়া হচ্ছে। 
        }
    } 
    for(int i=0;i<5;i++)
    {
        for(int j=0;j<3;j++)
        {
            printf("%d ",a[i][j]);   // আউটপুট প্রিন্ট করা হচ্ছে। 
        }
        printf("\n");
    } 
    return 0;
}
*/