/*
#include<stdio.h>
void fun(int n)
{
    if(n==0) return;   // বেস কেস। যখন সংখ্যাটি ১০ দিয়ে ভাগ করতে করতে শূন্য হয়ে যাবে। 
    int x=n%10;        // লাস্ট ডিজিট বের করে রাখা হচ্ছে। 
    fun(n/10);         // রিকারশন ফাংশনকে কল করা হচ্ছে।
    printf("%d ",x);   // ফাংশন কল হওয়া শেষে লাস্ট ডিজিটটি প্রিন্ট করা হচ্ছে।
}
int main()
{
    int test;
    scanf("%d",&test);        // টেস্টকেস ইনপুট নেওয়া হচ্ছে। 
    for(int t=0;t<test;t++)   // টেস্টকেস এর উপর লুপ চালানো হচ্ছে। 
    {
        int n;
        scanf("%d",&n);       // সংখ্যা ইনপুট নেওয়া হচ্ছে। 
        fun(n);               // রিকারশন ফাংশনকে কল করা হচ্ছে। 
        if(n==0)              // যদি সংখ্যাটি জিরো হয় তাহলে ফাংশন থেকে কিছু প্রিন্ট হবে না। কারন বেস কেসে আমরা জিরো দিয়ে করেছি। 
        {
            printf("0");      // ইনপুটে জিরো থাকলে জিরো প্রিন্ট করে দিচ্ছি সরাসরি। 
        }
        printf("\n");
    }
    return 0;
}
*/