/*
#include<stdio.h>

void sum(int x,int y)  // ফাংশন ডিক্লেয়ার করে রিটার্ন টাইপ হিসেবে void দেওয়া হয়েছে এবং প্যারামিটারে দুটি সংখ্যা নেওয়া হচ্ছে।
{
  int s=x+y;      // সংখ্যা দুটির যোগফল বের করা হচ্ছে।
  printf("%d\n",s);  // যোগফল এখানেই প্রিন্ট করা হচ্ছে যেহেতু আমরা কোন কিছু রিটার্ন করতে পারব না।
}
int main()
{
  int a,b;
  scanf("%d %d",&a,&b);  // দুটি সংখ্যা ইনপুট নেওয়া হচ্ছে। 
  sum(a,b);       // ফাংশনকে কল করে ইনপুট নেওয়া দুটি সংখ্যা প্যারামিটার হিসেবে দিয়ে দেওয়া হচ্ছে।
  return 0;
}
*/