/*
#include<stdio.h>

int main()

{

 char ar[5]; // ৫ সাইজের ক্যারেক্টার এরে ডিক্লেয়ার করা হয়েছে। 

 for(int i=0;i<5;i++) // ০ থেকে ৪ পর্যন্ত লুপ চালানো হচ্ছে।

 {

 scanf("%c",&ar[i]); // প্রতিটি ইন্ডেক্সে একটি করে ক্যারেক্টার ইনপুট নেওয়া হচ্ছে %c দিয়ে

 }

 for(int i=0;i<5;i++) // লুপ চালিয়ে প্রতিটি ইন্ডেক্সে যেয়ে

 {

 printf("%c",ar[i]); // ক্যারেক্টারটি প্রিন্ট করা হচ্ছে।

 }

 return 0;

}
*/

/*
#include<stdio.h>

int main()

{

 int a[5];

 printf("%d",sizeof(a));

 return 0;

}
*/


/*
#include<stdio.h>

int main()

{

 int a[5];

 printf("%d",sizeof(a)/sizeof(int)); // এরে মেমরিতে কত জায়গা নেয় (২০) সেটিকে একটি ইন্টিজার ভেরিয়েবল কত জায়গা নেয়(৪) তা দিয়ে ভাগ করা হচ্ছে। তাহলে ভাগফল আসবে ২০ / ৪ = ৫ যা হচ্ছে আমাদের এরের একচুয়াল সাইজ।

 

 return 0;

}
*/


/*
#include<stdio.h>

int main()

{

 char a[5]; // ৫ সাইজের ক্যারেক্টার এরে নেওয়া হয়েছে। 

 int sz=sizeof(a)/sizeof(char); // ক্যারেক্টার এরে কতটুকু জায়গা নিচ্ছে সেটিকে একটি ক্যারেক্টার কতটুকু জায়গা নেয় তা দিয়ে ভাগ করা হচ্ছে। তাহলে আমরা ক্যারেক্টার এরের সাইজ পেয়ে যাব।

 printf("%d",sz); // ক্যারেক্টার এরের সাইজটি প্রিন্ট করা হচ্ছে।

 return 0; 

}
*/