/*
#include<stdio.h>
#include<string.h>
int main()
{
    char a[1001],b[1001];
    scanf("%s",&a);      // স্ট্রিং ইনপুট নিচ্ছি। 
    strcpy(b,a);         // স্ট্রিংটি কপি করে আরেকটি স্ট্রিং এ রেখে দিচ্ছি। 
    int i=0,j=strlen(b)-1;    // দুটি পয়েন্টার নিচ্ছি। একটি স্ট্রিং এর শুরুতে ( ইন্ডেক্স ০ ) আরেকটি শেষে ( ইনডেক্স লেন্থ-১ ) 
    while(i<j)    // যতক্ষন প্রথম পয়েন্টারটি দ্বিতীয় পয়েন্টার থেকে আগে আছে ততক্ষন লুপ চালাচ্ছি।
    {
        char tmp=b[i];  
        b[i]=b[j];     // দুটি পয়েন্টারে থাকা ক্যারেক্টার দুটি সোয়াপ করে দেওয়া হচ্ছে। 
        b[j]=tmp;
        i++;         // প্রথম পয়েন্টারটি এগিয়ে নেওয়া হচ্ছে। 
        j--;         // দ্বিতীয় পয়েন্টারটি পিছিয়ে নেওয়া হচ্ছে। 
    }     // লুপ শেষে সম্পূর্ণ স্ট্রিংটি উল্টিয়ে যাবে।  
    if(strcmp(a,b)==0)      // এবার আমরা উল্টো স্ট্রিং এবং সোজা স্ট্রিং কম্পেয়ার করে দেখছি সেইম কিনা। 
    {
        printf("YES");     // সেইম হলে ইয়েস প্রিন্ট করে দিচ্ছি।
    }
    else 
    {
        printf("NO");     // আর সেইম না হলে নো প্রিন্ট করে দিচ্ছি।
    }
    return 0;
}
*/