/*
#include<stdio.h>
int main()
{
    int ar[5]={10,20,30,40,50};  // ৫ সাইজের এরে ডিক্লেয়ার করে = দিয়ে {} ব্রাকেটের মধ্যে কমা দিয়ে ভেলু দিয়ে দেওয়া হচ্ছে।
    for(int i=0;i<5;i++)    // তারপর আমরা এরে প্রিন্ট করে দেখছি ভেলুগুলো ঠিকভাবে প্রিন্ট হচ্ছে কিনা
    {
        printf("%d\n",ar[i]);
    }
    return 0;
}
*/



/*
#include<stdio.h>
int main()
{
    int ar[5]={10};  // এরের সাইজ বলা হয়েছে ৫ কিন্তু ভেলু দেওয়া হয়েছে মাত্র ১টি।
    for(int i=0;i<5;i++)    
    {
        printf("%d\n",ar[i]);
    }
    return 0;
}
*/



/*
#include<stdio.h>
int main()
{
    int ar[5]={0};  // ৫ সাইজের এরে নিয়ে একটি ভেলু হিসেবে ০ রেখে দিচ্ছি। বাকি ভেলুগুলো মেমরিতে অটো ০ হিসেবে সেইভ হয়ে যাবে। 
    for(int i=0;i<5;i++)
    {
        printf("%d\n",ar[i]); 
    }
    return 0;
}
*/