/*
#include<stdio.h>
int main()
{
    int n;
    scanf("%d",&n);   // এরে সাইজ ইনপুট নেওয়া হচ্ছে।
    int ar[n];      // ভেরিয়েবল সাইজ এরে ডিক্লেয়ার করা হচ্ছে।
*/


/*
#include<stdio.h>
int main()
{
    int n; 
    scanf("%d",&n);  // এরে সাইজ ইনপুট নেওয়া হচ্ছে।
    int ar[n];  // ওই সাইজের এরে ডিক্লেয়ার করা হচ্ছে। 
    for(int i=0;i<n;i++)   // ৫ সাইজের এরে হলে আমরা লুপ চালাতাম i<5 পর্যন্ত। এখন আমাদের সাইজ হচ্ছে n তাই আমরা লুপ চালাচ্ছি i<n পর্যন্ত।
    {
        scanf("%d",&ar[i]);  // ইনপুট নিচ্ছি। 
    }
    for(int i=0;i<n;i++)   // প্রথম ইন্ডেক্স থেকে লাস্ট ইন্ডেক্স পর্যন্ত লুপ চালিয়ে প্রিন্ট করা হচ্ছে।
    {
        printf("%d ",ar[i]);  
    }


    return 0;

}
*/


/*
#include<stdio.h>
int main()
{
    int n;
    scanf("%d",&n);
    int ar[n];
    for(int i=0;i<n;i++)
    {
        scanf("%d",&ar[i]);
    }
    for(int i=n-1;i>=0;i--)   // এরের লাস্ট ইন্ডেক্স n-1 থেকে প্রথম ইন্ডেক্স 0 পর্যন্ত লুপ চালানো হয়েছে। যেহেতু প্রতিবার ইন্ডেক্স এর মান ১ করে কমছে তাই i-- করে প্রতিবার i এর মান ১ করে কমানো হচ্ছে। 
    {
        printf("%d ",ar[i]);  // প্রিন্ট করা হচ্ছে। 
    }
    return 0;

}
*/