/*
#include<stdio.h>
int main()
{
    char a[5]={'R','a','h','a','t'}; // অন্য এরের মতো {} ব্রাকেট দিয়ে কমা দিয়ে দিয়ে ভেলু দিয়ে ইনিশিয়ালাইজ করা যায়। 
    char a[5]="Rahat";   // স্পেশাল পাওয়ারঃ এক লাইনে ব্রাকেট কমা ছাড়া জাস্ট ডাবল কোটেশনের মধ্যে রেখেও ইনিশিয়ালাইজ করা যায়।
    return 0;
}
*/

/*
#include<stdio.h>
int main()
{
    char a[5]="Hello";
    printf("%s",a);
    return 0;
}
*/

/*
#include<stdio.h>
int main()
{
    char a[6]="Hello\0";  // স্ট্রিং শেষে আমরা নাল ক্যারেক্টার রেখে দিচ্ছি এবং নাল সহ সাইজ ৬ হয় তাই আমরা ৬ সাইজ দিয়েছি। 
    printf("%s",a);
    return 0;
}
*/


/*
#include<stdio.h>
int main()
{
  char a[6]="Hello";  // আমাদের স্ট্রিং ৫ সাইজের কিন্তু আমরা এরে ডিক্লেয়ার করার সময় সাইজ দিচ্ছি ৬। ১ বেশি দেওয়া হচ্ছে নাল ক্যারেক্টার এর জন্য।
  printf("%s",a);
  return 0;
}
*/