/*
#include <stdio.h>
#include <stdlib.h>

int freq[1001];

int main()
{

    int *arr = (int *)malloc(5 * sizeof(int)); // ৫ সাইজের ডাইনামিক এরে ডিক্লেয়ার করা হলো

    for (int i = 0; i < 5; i++)
    {
        arr[i] = i + 1; // নরমাল এরে এর মতো ভ্যালু ইনপুট ও এসাইন করা যায়
    }

    for (int i = 0; i < 5; i++)
    {
        printf("%d ", arr[i]); // নরমাল এরে এর মতো ভ্যালু আউটপুট করা যায়
    }

    printf("\n");

    int *tmp = arr; // Reallocation এর সময় যাতে এরে টি হারিয়ে না যায় এর জন্য এর এড্রেস টি টেম্প এ রাখলাম

    arr = (int *)realloc(arr, 10 * sizeof(int)); // এরের  সাইজ বাড়িয়ে ১০ করে দিলাম

    if (arr == NULL)
    {              // যদি মেমরী এলোকেট করতে না পারে সেক্ষেত্রে realloc ফাংশন টি NULL রিটার্ন করে
        arr = tmp; // এক্ষেত্রে টেম্পের এড্রেস টি arr এ রাখার মাধ্যমে আমরা হারিয়ে যাওয়া এড্রেস টি খুজে পেলাম
    }

    for (int i = 5; i < 10; i++)
    {
        arr[i] = i + 1; // বাকি ইন্ডেক্স গুলোতে মান রাখলাম
    }

    for (int i = 0; i < 10; i++)
    {
        printf("%d ", arr[i]);
    } // ১০ সাইজের এরে টি প্রিন্ট করলাম

    free(arr); // কাজ শেষ হওয়ার পর arr এরের মেমোরী টি ক্লিয়ার করে ফেলছি।
}

Output:
1 2 3 4 5 
1 2 3 4 5 6 7 8 9 10 


*/