/*
#include<stdio.h>
int main()
{
    int row,col;
    scanf("%d %d",&row,&col);     // রো এবং কলাম ইনপুট নেওয়া হচ্ছে। 
    int a[row][col];          //  সেই রো এবং কলাম দিয়ে একটি 2D এরে ডিক্লেয়ার করা হচ্ছে। 
    int element=row*col;      // রো এবং কলাম গুন করে এলিমেন্ট সংখ্যা বের করা হচ্ছে।
    for(int i=0;i<row;i++)
    {
        for(int j=0;j<col;j++)
        {
            scanf("%d",&a[i][j]);   // ম্যাট্রিক্স ইনপুট নেওয়া হচ্ছে। 
        }
    }
    int cnt=0;     // জিরো কাউন্ট করার জন্য ভেরিয়েবল নিয়ে ০ দিয়ে ইনিশিয়াল করা হয়েছে। 
    for(int i=0;i<row;i++)
    {
        for(int j=0;j<col;j++)
        {
            if(a[i][j] == 0)   // নেস্টেড লুপ চালিয়ে সম্পূর্ণ ম্যাট্রিক্স এ যেয়ে ০ কাউন্ট করা হচ্ছে।
            {
                cnt++;
            }
        }
    }
    if(element == cnt)          // চেক করা হচ্ছে এলিমেন্ট সংখ্যা এবং জিরো সংখ্যা সেইম কিনা।
    {
        printf("Zero matrix\n");   // সেইম হলে জিরো ম্যাট্রিক্স। 
    }
    else 
    {
        printf("Not zero matrix\n");  // আর সেইম না হলে জিরো ম্যাট্রিক্স না। 
    }
    return 0;
}
*/